# sales-data-analysis

In [13]:
import pandas as pd

In [2]:
data = pd.read_csv("C:\\Users\\HP\\Downloads\\sales-data-analysis-main\\sales-data-analysis-main\\sales_data.csv")
data

           date     product     category   price  quantity  revenue
0    2022-01-01  Smartphone  Electronics   600.0      10.0   6000.0
1    2022-01-01      Laptop  Electronics  1200.0       5.0   6000.0
2    2022-01-02     T-Shirt     Clothing    20.0      50.0   1000.0
3    2022-01-03  Headphones  Electronics   100.0      20.0   2000.0
4    2022-01-04     T-Shirt     Clothing    20.0      25.0    500.0
..          ...         ...          ...     ...       ...      ...
364  2022-12-27       Watch  Accessories   150.0       5.0    750.0
365  2022-12-28        Coat     Clothing   100.0       5.0    500.0
366  2022-12-29  Headphones  Electronics   100.0      10.0   1000.0
367  2022-12-30  Smartphone  Electronics   600.0      11.0   6600.0
368  2022-12-31      Hoodie     Clothing    40.0      30.0   1200.0

[369 rows x 6 columns]

## What was the total revenue generated by the company over the course of the year?

In [3]:
total_revenue = data['revenue'].sum()
print('The total revenue : ',total_revenue)

The total revenue :  758330.0

## Which product had the highest revenue? How much revenue did it generate?

In [4]:
Total_revenue = data.groupby('product')['revenue'].sum()
Total_revenue.reset_index(name='Total_revenue')

       product  Total_revenue
0     Backpack        20400.0
1         Coat        33800.0
2   Headphones        18000.0
3       Hoodie        21000.0
4        Jeans        20650.0
5       Laptop         6000.0
6   Smartphone       434400.0
7   Smartwatch        58800.0
8     Sneakers        21600.0
9      Speaker        39680.0
10     T-Shirt        20100.0
11      Tablet        18000.0
12      Wallet        13200.0
13       Watch        32700.0

In [5]:
print(Total_revenue.idxmax(), ' : ',Total_revenue.max())

Smartphone  :  434400.0

##  What was the average price of a product sold by the company?

In [6]:
price_average =data['price'].mean()
print('The price average   :', price_average)

price_revenue =data['revenue'].mean()
print('The revenue average :', price_revenue)

The price average   : 211.22615803814713
The revenue average : 2060.679347826087

## What was the total quantity of products sold by the company?

In [7]:
data['quantity'].sum()

5360.0

## Which category had the highest revenue? How much revenue did it generate?

In [8]:
revenue_category = data.groupby('category')['revenue'].sum()
revenue_category.reset_index(name = 'Total revenue')

      category  Total revenue
0  Accessories       104700.0
1         Bags        19500.0
2         Bgas          900.0
3     Clohting         1200.0
4     Clothing        94350.0
5  Electronics       516080.0
6        Shoes        20640.0
7      Shoeses          960.0

In [9]:
print(revenue_category.idxmax(), ' : ', revenue_category.max())

Electronics  :  516080.0

## What was the average revenue per sale?

In [10]:
#The average revenue per sale = Total revenue / Number of sales
Total__revenue = data['revenue'].sum()
Number_of_sales = data['quantity'].sum()

In [11]:
print('The average revenue per sale :',Total__revenue/ Number_of_sales)

The average revenue per sale : 141.4794776119403

## What was the total revenue generated in each quarter of the year? (i.e. Q1, Q2, Q3, Q4)

In [12]:
data['date'] = pd.to_datetime(data['date'])      # Convert the 'date' column to a datetime format

data['quarter'] = data['date'].apply(lambda x: x.quarter)   # Create a new column 'quarter' to represent the quarter of each sale using .apply()

quarterly_revenue = data.groupby('quarter')['revenue'].sum()    # Group the data by 'quarter' and calculate the sum of 'revenue' for each quarter

print(quarterly_revenue)

quarter
1    182100.0
2    183970.0
3    197680.0
4    194580.0
Name: revenue, dtype: float64